package database;

import android.content.Context;
import android.database.sqlite.SQLiteDatabase;
import android.database.sqlite.SQLiteOpenHelper;

public class gymarticleBaseHelper extends SQLiteOpenHelper {
    private static final int VERSION=1;
    private static final String DATEBASE_NAME="gymarticle";
    public gymarticleBaseHelper(Context context, String name, SQLiteDatabase.CursorFactory factory, int version){
        super(context,DATEBASE_NAME,null,VERSION);
    }

    @Override
    public void onCreate(SQLiteDatabase db) {
        db.execSQL("CREATE TABLE gymarticle(" +
                "id INTEGER PRIMARY KEY AUTOINCREMENT," +
                "time VARCHAR(255)," +
                "thing VARCHAR(255))");

        db.execSQL(
                "INSERT INTO gymarticle(id,time,thing) values(?,?,?)",new Object[] { 1,
                        "要么读书,要么健身",
                        "要么健身，要么读书，身体和灵魂，必须有一个在路上。在等待的日子里，刻苦读书，锻炼身体，谦卑做人，养得深根，日后才能枝叶茂盛。比起后悔，我更喜欢第二天的酸痛，生活从未变得轻松，是你在一点一点变强大。懒惰是很奇怪的东西，它使你以为那是安逸，是休息，是福气；但实际上它所给你的是无聊，是倦怠，是消沉；它剥夺你对前途的希望，割断你和别人之间的友情，使你心胸日渐狭窄，对人生也越来越怀疑。\n" +
                                "\n" +
                                "有时候，一旦你开始跑步，就只跑了10分钟，便会顺其自然完成整段路线，并获得极大的满足感。\n" +
                                "\n" +
                                "当没有动力的时候，想想之前跑完每段路程后的喜悦及轻松心情，你的犹豫就会烟消云散，开始只往前跑。\n" +
                                "\n" +
                                "不要让你在你最美好的时光里成为一个胖子。\n" +
                                "\n" +
                                "同样地，你跑过的路从来不会欺骗你，他们沉淀在你的精气神中，你的改变谁都可以感受到。\n" +
                                "\n" +
                                "最怕一个人摆出一副苦样，你对自己都没信心，别人怎么会对你有信心？工作不顺可以宣泄，感情不顺就顺其自然。\n" +
                                "\n" +
                                "对外表不满，你可以从其他方面努力，生活不顺，可以看书静心，总能找到对自己负责的办法，最没用就是摆出我最惨的样子，实在不行让自己放松几天，看场电影，出去跑步！\n" +
                                "\n" +
                                "所以请不要说：等我有时间了，就能去运动了。等我赚够钱了，就能孝敬父母了。等我有空了，就能陪你了，等我发达了，就能行善了，等到我们有钱了，健康已经没了。\n" +
                                "\n" +
                                "等到我们赚够钱了，父母已经等不及了，等到我们真正有空了，爱人已经离开了，等到发达了，心态也已经变了。\n" +
                                "\n" +
                                "健身、孝老、陪伴、行善，任何时候都可以！不必等！在生活和工作中别逢人就低头，别逢人就诉苦，旁人终归是旁人，没几个人真把你的伤当自己的痛处。有些人以为你无坚不摧，那就随他们，别人不知道的，你没必要反驳给他听。\n" +
                                "\n" +
                                "自己选的就向前走，再苦再累也别停下。这一生认真努力工作，坚持锻炼身体，心安理得生活。\n" +
                                "\n" +
                                "\n" +
                                "\n" +
                                "扩展资料：\n" +
                                "\n" +
                                "游泳、快走、慢跑、骑自行车，及一切有氧运动都能锻炼心脏，有氧运动好处多：能锻炼心肺、增强循环系统功能、燃烧脂肪、加大肺活量、降低血压，甚至能预防糖尿病，减少心脏病的发生。美国运动医学院建议，想知道有氧运动强度是否合适，可在运动后测试心率，以达到最高心率的60%—90%为宜。\n" +
                                "\n" +
                                "如果想通过有氧运动来减肥，可以选择低度到中度的运动强度，同时延长运动时间，这种方法消耗的热量更多，运动频率每周3—5次，每次20—60分钟。想要锻炼肌肉，可以练举重、做体操以及其他重复伸、屈肌肉的运动。\n" +
                                "\n" +
                                "肌肉锻炼可以燃烧热量、增强骨密度、减少受伤，尤其是关节受伤的几率，还能预防骨质疏松。 在做举重运动前，先测一下，如果连续举8次你最多能举多重的东西，就从这个重量开始练习。\n" +
                                "\n" +
                                "当你可以连续12次举起这个重量时，试试增加5%的重量。注意每次练习时，要连续举8—12次，这样可以达到肌肉最大耐力的70%—80%，锻炼效果较好。每周2—3次，但要避免连续两天锻炼同一组肌肉群， 以便让肌肉有充分的恢复时间。",
                });

        db.execSQL(
                "INSERT INTO gymarticle(id,time,thing) values(?,?,?)",new Object[] { 2,
                        "一篇让你看完终身受益的健身文章",
                        "首先、健身对我而言不是简单的体能训练，它至少需要将训练、心理、饮食这三个层面相结合、才能够给反馈给你想要的一种态度，它也不是一个短期目标而是一种积极向上的健康生活方式。\n" +
                                "\n" +
                                "1、训练方面：其实大家会发现，健身房很多练得很棒的朋友、他们并不是那些整天请各种教练（小编题外话哈：有些健身房的私人教练身材太一般了，甚至渣的掉渣......）或者忙于计算卡路里的人、而是更多着浏览健身杂志文章、高手训练视频等，用心去感受每一块肌肉的运动轨迹和充血后的泵感，其实训练动作并没有绝对地对错（只是相对的标准而言），因每个人身体状况的特殊性，所以最好的并不一定是适合自己的、适合自己的才是最好的，多去尝试解锁各种动作，你都没有试怎么知道哪个动作最适合自己？\n" +
                                "\n" +
                                "2、心理层面上：要做到积极、乐观、向上、享受每一次健身所带来的各种快感、让健身成为一件快乐的事，在健身房里多向那些大咖学习，虚心请教动作解析和饮食均衡。平时身边也大致分为两种人：一种整天抱怨自己进步缓慢、纠结于各种身体数字游戏；另外一种整天活力无限、说起运动浑身是劲。前者其实并非无进步、只是自己看不到、整天唉声叹气抱怨的人情况严重还会影响身边的朋友走向低谷。后者享受自己的每一次畅快运动、进步自然水到渠成。小编最喜欢和积极正能量的人交朋友了，每一次运动都充满好心情~\n" +
                                "\n" +
                                "3、饮食层面上：随着近两年健身热潮在国内的兴起，越来越多的朋友意识到饮食对于身材的革命性作用。当然话说“三分练七分吃”也是需要配合一定的训练基础才能体现的、我们经常看到国外那些健身的帅哥美女们，他们身材也不是天生就那样完美的、但他们都有一个共同点：做得一手好饭，懂得营养搭配！很多朋友整天拼命地疯狂训练，但总是抱怨自己身材没啥变化，如果你的身材还是这种状态，真心不妨尝试一下从一日三餐的饮食控制开始，为自己身体搭配所需要的营养套餐，我坚信尝试过的朋友早已受益匪浅，不愿控制嘴的也许至今还在抱怨中......\n" +
                                "\n" +
                                "希望所有热爱健身的朋友尊重身体自然生长、循序渐进、健身是一辈子的事、切勿急于求成、一辈子健健康康才是最大的财富！",
                });



    }
    @Override
    public void onUpgrade(SQLiteDatabase db, int oldVersion, int newVersion) {
        db.execSQL("DROP TABLE IF EXISTS diary");
        onCreate(db);
    }
}